#ifndef GUARD_COMPATIBILITY_H
#define GUARD_COMPATIBILITY_H

#include "constants/global.h"
#include "constants/battle.h"

// Vanilla species defines
#define VANILLA_SPECIES_NONE 0
#define VANILLA_SPECIES_BULBASAUR 1
#define VANILLA_SPECIES_IVYSAUR 2
#define VANILLA_SPECIES_VENUSAUR 3
#define VANILLA_SPECIES_CHARMANDER 4
#define VANILLA_SPECIES_CHARMELEON 5
#define VANILLA_SPECIES_CHARIZARD 6
#define VANILLA_SPECIES_SQUIRTLE 7
#define VANILLA_SPECIES_WARTORTLE 8
#define VANILLA_SPECIES_BLASTOISE 9
#define VANILLA_SPECIES_CATERPIE 10
#define VANILLA_SPECIES_METAPOD 11
#define VANILLA_SPECIES_BUTTERFREE 12
#define VANILLA_SPECIES_WEEDLE 13
#define VANILLA_SPECIES_KAKUNA 14
#define VANILLA_SPECIES_BEEDRILL 15
#define VANILLA_SPECIES_PIDGEY 16
#define VANILLA_SPECIES_PIDGEOTTO 17
#define VANILLA_SPECIES_PIDGEOT 18
#define VANILLA_SPECIES_RATTATA 19
#define VANILLA_SPECIES_RATICATE 20
#define VANILLA_SPECIES_SPEAROW 21
#define VANILLA_SPECIES_FEAROW 22
#define VANILLA_SPECIES_EKANS 23
#define VANILLA_SPECIES_ARBOK 24
#define VANILLA_SPECIES_PIKACHU 25
#define VANILLA_SPECIES_RAICHU 26
#define VANILLA_SPECIES_SANDSHREW 27
#define VANILLA_SPECIES_SANDSLASH 28
#define VANILLA_SPECIES_NIDORAN_F 29
#define VANILLA_SPECIES_NIDORINA 30
#define VANILLA_SPECIES_NIDOQUEEN 31
#define VANILLA_SPECIES_NIDORAN_M 32
#define VANILLA_SPECIES_NIDORINO 33
#define VANILLA_SPECIES_NIDOKING 34
#define VANILLA_SPECIES_CLEFAIRY 35
#define VANILLA_SPECIES_CLEFABLE 36
#define VANILLA_SPECIES_VULPIX 37

// Emerald
#define VANILLA_ITEM_MAGMA_EMBLEM 375
#define VANILLA_ITEM_OLD_SEA_MAP 376

#define VANILLA_ITEMS_COUNT 377

// Pokemon struct data

// Property labels for Get(Box)MonData / Set(Box)MonData
enum {
    VANILLA_MON_DATA_PERSONALITY,
    VANILLA_MON_DATA_OT_ID,
    VANILLA_MON_DATA_NICKNAME,
    VANILLA_MON_DATA_LANGUAGE,
    VANILLA_MON_DATA_SANITY_IS_BAD_EGG,
    VANILLA_MON_DATA_SANITY_HAS_SPECIES,
    VANILLA_MON_DATA_SANITY_IS_EGG,
    VANILLA_MON_DATA_OT_NAME,
    VANILLA_MON_DATA_MARKINGS,
    VANILLA_MON_DATA_CHECKSUM,
    VANILLA_MON_DATA_ENCRYPT_SEPARATOR,
    VANILLA_MON_DATA_SPECIES,
    VANILLA_MON_DATA_HELD_ITEM,
    VANILLA_MON_DATA_MOVE1,
    VANILLA_MON_DATA_MOVE2,
    VANILLA_MON_DATA_MOVE3,
    VANILLA_MON_DATA_MOVE4,
    VANILLA_MON_DATA_PP1,
    VANILLA_MON_DATA_PP2,
    VANILLA_MON_DATA_PP3,
    VANILLA_MON_DATA_PP4,
    VANILLA_MON_DATA_PP_BONUSES,
    VANILLA_MON_DATA_COOL,
    VANILLA_MON_DATA_BEAUTY,
    VANILLA_MON_DATA_CUTE,
    VANILLA_MON_DATA_EXP,
    VANILLA_MON_DATA_HP_EV,
    VANILLA_MON_DATA_ATK_EV,
    VANILLA_MON_DATA_DEF_EV,
    VANILLA_MON_DATA_SPEED_EV,
    VANILLA_MON_DATA_SPATK_EV,
    VANILLA_MON_DATA_SPDEF_EV,
    VANILLA_MON_DATA_FRIENDSHIP,
    VANILLA_MON_DATA_SMART,
    VANILLA_MON_DATA_POKERUS,
    VANILLA_MON_DATA_MET_LOCATION,
    VANILLA_MON_DATA_MET_LEVEL,
    VANILLA_MON_DATA_MET_GAME,
    VANILLA_MON_DATA_POKEBALL,
    VANILLA_MON_DATA_HP_IV,
    VANILLA_MON_DATA_ATK_IV,
    VANILLA_MON_DATA_DEF_IV,
    VANILLA_MON_DATA_SPEED_IV,
    VANILLA_MON_DATA_SPATK_IV,
    VANILLA_MON_DATA_SPDEF_IV,
    VANILLA_MON_DATA_IS_EGG,
    VANILLA_MON_DATA_ABILITY_NUM,
    VANILLA_MON_DATA_TOUGH,
    VANILLA_MON_DATA_SHEEN,
    VANILLA_MON_DATA_OT_GENDER,
    VANILLA_MON_DATA_COOL_RIBBON,
    VANILLA_MON_DATA_BEAUTY_RIBBON,
    VANILLA_MON_DATA_CUTE_RIBBON,
    VANILLA_MON_DATA_SMART_RIBBON,
    VANILLA_MON_DATA_TOUGH_RIBBON,
    VANILLA_MON_DATA_STATUS,
    VANILLA_MON_DATA_LEVEL,
    VANILLA_MON_DATA_HP,
    VANILLA_MON_DATA_MAX_HP,
    VANILLA_MON_DATA_ATK,
    VANILLA_MON_DATA_DEF,
    VANILLA_MON_DATA_SPEED,
    VANILLA_MON_DATA_SPATK,
    VANILLA_MON_DATA_SPDEF,
    VANILLA_MON_DATA_MAIL,
    VANILLA_MON_DATA_SPECIES_OR_EGG,
    VANILLA_MON_DATA_IVS,
    VANILLA_MON_DATA_CHAMPION_RIBBON,
    VANILLA_MON_DATA_WINNING_RIBBON,
    VANILLA_MON_DATA_VICTORY_RIBBON,
    VANILLA_MON_DATA_ARTIST_RIBBON,
    VANILLA_MON_DATA_EFFORT_RIBBON,
    VANILLA_MON_DATA_MARINE_RIBBON,
    VANILLA_MON_DATA_LAND_RIBBON,
    VANILLA_MON_DATA_SKY_RIBBON,
    VANILLA_MON_DATA_COUNTRY_RIBBON,
    VANILLA_MON_DATA_NATIONAL_RIBBON,
    VANILLA_MON_DATA_EARTH_RIBBON,
    VANILLA_MON_DATA_WORLD_RIBBON,
    VANILLA_MON_DATA_UNUSED_RIBBONS,
    VANILLA_MON_DATA_MODERN_FATEFUL_ENCOUNTER,
    VANILLA_MON_DATA_KNOWN_MOVES,
    VANILLA_MON_DATA_RIBBON_COUNT,
    VANILLA_MON_DATA_RIBBONS,
    VANILLA_MON_DATA_ATK2,
    VANILLA_MON_DATA_DEF2,
    VANILLA_MON_DATA_SPEED2,
    VANILLA_MON_DATA_SPATK2,
    VANILLA_MON_DATA_SPDEF2,
};

struct VanillaPokemonSubstruct0
{
    u16 species;
    u16 heldItem;
    u32 experience;
    u8 ppBonuses;
    u8 friendship;
    u16 filler;
};

struct VanillaPokemonSubstruct1
{
    u16 moves[MAX_MON_MOVES];
    u8 pp[MAX_MON_MOVES];
};

struct VanillaPokemonSubstruct2
{
    u8 hpEV;
    u8 attackEV;
    u8 defenseEV;
    u8 speedEV;
    u8 spAttackEV;
    u8 spDefenseEV;
    u8 cool;
    u8 beauty;
    u8 cute;
    u8 smart;
    u8 tough;
    u8 sheen;
};

struct VanillaPokemonSubstruct3
{
 /* 0x00 */ u8 pokerus;
 /* 0x01 */ u8 metLocation;

 /* 0x02 */ u16 metLevel:7;
 /* 0x02 */ u16 metGame:4;
 /* 0x03 */ u16 pokeball:4;
 /* 0x03 */ u16 otGender:1;

 /* 0x04 */ u32 hpIV:5;
 /* 0x04 */ u32 attackIV:5;
 /* 0x05 */ u32 defenseIV:5;
 /* 0x05 */ u32 speedIV:5;
 /* 0x05 */ u32 spAttackIV:5;
 /* 0x06 */ u32 spDefenseIV:5;
 /* 0x07 */ u32 isEgg:1;
 /* 0x07 */ u32 abilityNum:1;

 /* 0x08 */ u32 coolRibbon:3;               // Stores the highest contest rank achieved in the Cool category.
 /* 0x08 */ u32 beautyRibbon:3;             // Stores the highest contest rank achieved in the Beauty category.
 /* 0x08 */ u32 cuteRibbon:3;               // Stores the highest contest rank achieved in the Cute category.
 /* 0x09 */ u32 smartRibbon:3;              // Stores the highest contest rank achieved in the Smart category.
 /* 0x09 */ u32 toughRibbon:3;              // Stores the highest contest rank achieved in the Tough category.
 /* 0x09 */ u32 championRibbon:1;           // Given when defeating the Champion. Because both RSE and FRLG use it, later generations don't specify from which region it comes from.
 /* 0x0A */ u32 winningRibbon:1;            // Given at the Battle Tower's Level 50 challenge by winning a set of seven battles that extends the current streak to 56 or more.
 /* 0x0A */ u32 victoryRibbon:1;            // Given at the Battle Tower's Level 100 challenge by winning a set of seven battles that extends the current streak to 56 or more.
 /* 0x0A */ u32 artistRibbon:1;             // Given at the Contest Hall by winning a Master Rank contest with at least 800 points, and agreeing to have the Pokémon's portrait placed in the museum after being offered.
 /* 0x0A */ u32 effortRibbon:1;             // Given at Slateport's market to Pokémon with maximum EVs.
 /* 0x0A */ u32 marineRibbon:1;             // Never distributed.
 /* 0x0A */ u32 landRibbon:1;               // Never distributed.
 /* 0x0A */ u32 skyRibbon:1;                // Never distributed.
 /* 0x0A */ u32 countryRibbon:1;            // Distributed during Pokémon Festa '04 and '05 to tournament winners.
 /* 0x0B */ u32 nationalRibbon:1;           // Given to purified Shadow Pokémon in Colosseum/XD.
 /* 0x0B */ u32 earthRibbon:1;              // Given to teams that have beaten Mt. Battle's 100-battle challenge in Colosseum/XD.
 /* 0x0B */ u32 worldRibbon:1;              // Distributed during Pokémon Festa '04 and '05 to tournament winners.
 /* 0x0B */ u32 unusedRibbons:4;            // Discarded in Gen 4.

 // The functionality of this bit changed in FRLG:
 // In RS, this bit does nothing, is never set, & is accidentally unset when hatching Eggs.
 // In FRLG & Emerald, this controls Mew & Deoxys obedience and whether they can be traded.
 // If set, a Pokémon is a fateful encounter in FRLG's summary screen if hatched & for all Pokémon in Gen 4+ summary screens.
 // Set for in-game event island legendaries, events distributed after a certain date, & Pokémon from XD: Gale of Darkness.
 // Not to be confused with METLOC_FATEFUL_ENCOUNTER.
 /* 0x0B */ u32 modernFatefulEncounter:1;
};

// Number of bytes in the largest Pokémon substruct.
// They are assumed to be the same size, and will be padded to
// the largest size by the union.
// By default they are all 12 bytes.
#define VANILLA_NUM_SUBSTRUCT_BYTES (max(sizeof(struct VanillaPokemonSubstruct0),     \
                             max(sizeof(struct VanillaPokemonSubstruct1),     \
                             max(sizeof(struct VanillaPokemonSubstruct2),     \
                                 sizeof(struct VanillaPokemonSubstruct3)))))

union VanillaPokemonSubstruct
{
    struct VanillaPokemonSubstruct0 type0;
    struct VanillaPokemonSubstruct1 type1;
    struct VanillaPokemonSubstruct2 type2;
    struct VanillaPokemonSubstruct3 type3;
    u16 raw[VANILLA_NUM_SUBSTRUCT_BYTES / 2]; // /2 because it's u16, not u8
};

struct VanillaBoxPokemon
{
    u32 personality;
    u32 otId;
    u8 nickname[VANILLA_POKEMON_NAME_LENGTH];
    u8 language;
    u8 isBadEgg:1;
    u8 hasSpecies:1;
    u8 isEgg:1;
    u8 blockBoxRS:1; // Unused, but Pokémon Box Ruby & Sapphire will refuse to deposit a Pokémon with this flag set
    u8 unused:4;
    u8 otName[PLAYER_NAME_LENGTH];
    u8 markings;
    u16 checksum;
    u16 unknown;

    union
    {
        u32 raw[(VANILLA_NUM_SUBSTRUCT_BYTES * 4) / 4]; // *4 because there are 4 substructs, /4 because it's u32, not u8
        union VanillaPokemonSubstruct substructs[4];
    } secure;
};

struct VanillaPokemon
{
    struct VanillaBoxPokemon box;
    u32 status;
    u8 level;
    u8 mail;
    u16 hp;
    u16 maxHP;
    u16 attack;
    u16 defense;
    u16 speed;
    u16 spAttack;
    u16 spDefense;
};

// Vanilla Battle Structs
struct VanillaDisableStruct
{
    u32 transformedMonPersonality;
    u16 disabledMove;
    u16 encoredMove;
    u8 protectUses;
    u8 stockpileCounter;
    u8 substituteHP;
    u8 disableTimer:4;
    u8 disableTimerStartValue:4;
    u8 encoredMovePos;
    u8 filler_D; // Unused field.
    u8 encoreTimer:4;
    u8 encoreTimerStartValue:4;
    u8 perishSongTimer:4;
    u8 perishSongTimerStartValue:4;
    u8 furyCutterCounter;
    u8 rolloutTimer:4;
    u8 rolloutTimerStartValue:4;
    u8 chargeTimer:4;
    u8 chargeTimerStartValue:4;
    u8 tauntTimer:4;
    u8 tauntTimer2:4;
    u8 battlerPreventingEscape;
    u8 battlerWithSureHit;
    u8 isFirstTurn;
    u8 filler_17; // Unused field.
    u8 truantCounter:1;
    u8 truantSwitchInHack:1;
    u8 filler_18_2:2; // Unused field.
    u8 mimickedMoves:4;
    u8 rechargeTimer;
};

#define VANILLA_TEXT_BUFF_ARRAY_COUNT 16

struct VanillaBattleMsgData
{
    u16 currentMove;
    u16 originallyUsedMove;
    u16 lastItem;
    u8 lastAbility;
    u8 scrActive;
    u8 bakScriptPartyIdx;
    u8 hpScale;
    u8 itemEffectBattler;
    u8 moveType;
    u8 abilities[MAX_BATTLERS_COUNT];
    u8 textBuffs[3][VANILLA_TEXT_BUFF_ARRAY_COUNT];
};

struct VanillaBattlePokemon
{
    /*0x00*/ u16 species;
    /*0x02*/ u16 attack;
    /*0x04*/ u16 defense;
    /*0x06*/ u16 speed;
    /*0x08*/ u16 spAttack;
    /*0x0A*/ u16 spDefense;
    /*0x0C*/ u16 moves[MAX_MON_MOVES];
    /*0x14*/ u32 hpIV:5;
    /*0x14*/ u32 attackIV:5;
    /*0x15*/ u32 defenseIV:5;
    /*0x15*/ u32 speedIV:5;
    /*0x16*/ u32 spAttackIV:5;
    /*0x17*/ u32 spDefenseIV:5;
    /*0x17*/ u32 isEgg:1;
    /*0x17*/ u32 abilityNum:1;
    /*0x18*/ s8 statStages[NUM_BATTLE_STATS];
    /*0x20*/ u8 ability;
    /*0x21*/ u8 type1;
    /*0x22*/ u8 type2;
    /*0x23*/ u8 unknown;
    /*0x24*/ u8 pp[MAX_MON_MOVES];
    /*0x28*/ u16 hp;
    /*0x2A*/ u8 level;
    /*0x2B*/ u8 friendship;
    /*0x2C*/ u16 maxHP;
    /*0x2E*/ u16 item;
    /*0x30*/ u8 nickname[VANILLA_POKEMON_NAME_LENGTH + 1];
    /*0x3B*/ u8 ppBonuses;
    /*0x3C*/ u8 otName[PLAYER_NAME_LENGTH + 1];
    /*0x44*/ u32 experience;
    /*0x48*/ u32 personality;
    /*0x4C*/ u32 status1;
    /*0x50*/ u32 status2;
    /*0x54*/ u32 otId;
};

// Battle animation general ids
#define VANILLA_B_ANIM_CASTFORM_CHANGE          0
#define VANILLA_B_ANIM_STATS_CHANGE             1
#define VANILLA_B_ANIM_SUBSTITUTE_FADE          2
#define VANILLA_B_ANIM_SUBSTITUTE_APPEAR        3
#define VANILLA_B_ANIM_POKEBLOCK_THROW          4
#define VANILLA_B_ANIM_ITEM_KNOCKOFF            5
#define VANILLA_B_ANIM_TURN_TRAP                6
#define VANILLA_B_ANIM_HELD_ITEM_EFFECT         7
#define VANILLA_B_ANIM_SMOKEBALL_ESCAPE         8
#define VANILLA_B_ANIM_FOCUS_BAND               9
#define VANILLA_B_ANIM_RAIN_CONTINUES           10
#define VANILLA_B_ANIM_SUN_CONTINUES            11
#define VANILLA_B_ANIM_SANDSTORM_CONTINUES      12
#define VANILLA_B_ANIM_HAIL_CONTINUES           13
#define VANILLA_B_ANIM_LEECH_SEED_DRAIN         14
#define VANILLA_B_ANIM_MON_HIT                  15
#define VANILLA_B_ANIM_ITEM_STEAL               16
#define VANILLA_B_ANIM_SNATCH_MOVE              17
